
<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Document</title>
  <link rel="stylesheet" href="ertegiler.css">
</head>
<body>
<div id="page_container">
  
	<div id="main_content">

		<div class="front face">
    		
    		<!-- ALL THE SITE CONTENT GOES HERE -->
    		
    		<header class="clearfix">
	
				<nav class="clearfix">
					<a id="menu-toggle" class="anchor-link" href="#mobile-nav">MENU</a>
					<ul>
          <li><a href="#">Мазмұн</a></li>
			        	<li><a href="kirispe.php">Кіріспе</a></li>	
			        	<li><a href="adister.php">Тексеру әдістері</a></li>
			        	<li><a href="quraldar.php">Тексеру құралдары</a></li>
			        	<li><a href="natige.php">Нәтижелерін талдау</a></li>
			        	<li><a href="strt.php">Тексеру стратегиялары</a></li>
                <li><a href="#">Мобильді және веб тестілеу</a></li>
                <li><a href="#">Ойын сынағы</a></li>
                <li><a href="#">Нақты жобалар</a></li>
			        	<li><a href="/index.php">GALAM</a></li>
			        </ul>
				</nav>
			
				<h1>Кіріспе</h1>

			</header>
			
			
			<article class="clearfix">
     <h5>  <a href="">I. Бағдарламалық қамтамасыз етуді тестілеуге кіріспе</a></h5> 
     <Ul> 
      <li>Бағдарламалық қамтамасыз етуді тестілеудің мақсаттары мен міндеттері</li>
      <li>Бағдарламалық қамтамасыз етуді тестілеудің негізгі түрлері</li>
      <li>Бағдарламалық қамтамасыз етуді тексерудің өмірлік циклі</li></Ul>
 <p>Марктың бағдарламашы ретіндегі өмірі ерте жастан компьютерге деген құштарлықтан басталды. Ол күндіз-түні өз жобаларында тыңғылықты жұмыс істеді, бұл ақырында бағдарламалық жасақтаманы жасауға әкелді. Дегенмен, Марк IT индустриясында мансабын бастағанда, оның барлық бағдарламаларында қателер бар және дұрыс жұмыс істемейтініне қатты таң қалды.

Ол өз бағдарламаларындағы қателерді болдырмау жолдарын іздей бастады және көмек алу үшін бағдарламалық жасақтаманы тестілеу жөніндегі басқа сарапшыға жүгінді. Сарапшы Маркқа бағдарламалық жасақтаманы тестілеу әзірлеу үдерісіндегі қажетті қадам болып табылатынын және оған бағдарлама барысында орын алуы мүмкін қателерді анықтауға көмектесетінін түсіндірді.

Марк тестілеудің мақсаттары мен міндеттерін, тестілеудің негізгі түрлерін, тестілеудің өмірлік циклін және сынақ құжаттамасын қоса алғанда, бағдарламалық қамтамасыз етуді тестілеудің негіздерін үйрене бастады. Ол Selenium және JMeter сияқты тестілеуді автоматтандыру құралдарын үйреніп, оларды өз жобаларында қолдана бастады.

Ол сондай-ақ сынақтарды жоспарлауды, сынақ жоспарлары мен сценарийлерін жасауды, сынақ нәтижелерін талдауды және қателер туралы есептерді басқаруды үйренді. Марк бағдарламадағы қателер мен ақауларды анықтау және түзету үшін бағдарламалық жасақтаманың өмірлік циклінің барлық кезеңдерінде бағдарламалық қамтамасыз етуді тестілеуді жүзеге асыру керектігін түсінді.

Марк бағдарламаларының қатесіз жұмыс істейтініне көз жеткізу үшін тәуекелге негізделген тестілеуді және әзірлеу циклін сынауды қоса алғанда, әртүрлі тестілеу стратегияларын қолданды. Ол сондай-ақ функционалдылықты, өнімділікті, қауіпсіздікті, үйлесімділікті, қолжетімділікті және ыңғайлылықты тексеруді үйренді.

Марк ақырында қатесіз жұмыс істейтін бағдарламалар жасаған табысты бағдарламалық жасақтама әзірлеушісі болды. Ол басқа бағдарламашыларға бағдарламалық қамтамасыз етуді тестілеудің маңыздылығын және оны қалай дұрыс орындау керектігін үйрете бастады.</p>
			
			</article>
			
			
	
  		
  		</div><!-- END .front -->
  		
  		
	</div><!-- END #main_content -->

</div><!-- END #page_container -->
</body>
</html>