
<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Document</title>
  <link rel="stylesheet" href="ertegiler.css">
</head>
<body>
<div id="page_container">
  
	<div id="main_content">

		<div class="front face">
    		
    		<!-- ALL THE SITE CONTENT GOES HERE -->
    		
    		<header class="clearfix">
	
				<nav class="clearfix">
					<a id="menu-toggle" class="anchor-link" href="#mobile-nav">MENU</a>
					<ul>
          <li><a href="#">Мазмұн</a></li>
			        	<li><a href="kirispe.php">Кіріспе</a></li>	
			        	<li><a href="adister.php">Тексеру әдістері</a></li>
			        	<li><a href="quraldar.php">Тексеру құралдары</a></li>
			        	<li><a href="natige.php">Нәтижелерін талдау</a></li>
			        	<li><a href="strt.php">Тексеру стратегиялары</a></li>
                <li><a href="#">Мобильді және веб тестілеу</a></li>
                <li><a href="#">Ойын сынағы</a></li>
                <li><a href="#">Нақты жобалар</a></li>
			        	<li><a href="index.php">GALAM</a></li>
			        </ul>
				</nav>
			
				<h1>Мазұндама</h1>

			</header>
			
			
			<article class="clearfix">
     <h5>  <a href="">I. Бағдарламалық қамтамасыз етуді тестілеуге кіріспе</a></h5> 
     <Ul> 
      <li>Бағдарламалық қамтамасыз етуді тестілеудің мақсаттары мен міндеттері</li>
      <li>Бағдарламалық қамтамасыз етуді тестілеудің негізгі түрлері</li>
      <li>Бағдарламалық қамтамасыз етуді тексерудің өмірлік циклі</li></Ul>
 <h5><a href="">  II. Бағдарламалық қамтамасыз етуді тексеру әдістері</a> </h5>
<ul>
<li>
Функционалдық тестілеу</li>
<li>Өнімділік пен жүктемені сынау
<li>Қауіпсіздік сынағы
<li>Үйлесімділік сынағы
<li>Қол жетімділікті тексеру
<li>Қолдану мүмкіндігін тексеру
</li></Ul>
<h5><a href="">  III. Бағдарламалық қамтамасыз етуді тексеру құралдары </a></h5>
<ul>
<li>Сынақ автоматтандыру құралдары
<li>Сынақтарды басқару құралдары
<li>Сынақ деректерін құру құралдары
<li>Тест нәтижелерін талдауға арналған құралдар
</li></Ul>
<h5><a href=""> IV. Бағдарламалық қамтамасыз етуді тестілеуді жоспарлау және ұйымдастыру </a> </h5>
<ul>
<li>Бағдарламалық қамтамасыз етуді тексеруді жоспарлау
<li>Сынақ жоспарлары мен сценарийлерін құру
<li>Жоба аясында тестілеуді ұйымдастыру</li></Ul>
<h5><a href=""> V. Бағдарламалық қамтамасыз етуді тестілеу нәтижелерін талдау және есеп беру </a> </h5>
<ul>
<li>Тест нәтижелерін талдау
<li>Бағдарламалық қамтамасыз ету сапасын бағалау
<li>Сынақ есептерін жасау
</li></Ul>
<h5><a href=""> VI. Бағдарламалық қамтамасыз етуді тексеру стратегиялары  </a></h5>
<ul>
<li>Тәуекелге негізделген тестілеу стратегиялары
<li>Даму цикліне негізделген тестілеу стратегиялары
<li>Сынақ жағдайларына негізделген сынақ стратегиялары
<li>Тест жағдайларына негізделген сынақ стратегиялары</li></Ul>
<h5><a href=""> VII. Мобильді қолданбаларды тестілеу </a> </h5>
<ul>
<li>Мобильді қосымшаларды тестілеудің ерекшеліктері
<li>Мобильді қолданбаларды тестілеу құралдары мен әдістері
<li>Веб қолданбалы тестілеу

<li>Веб-қосымшаларды тестілеудің ерекшеліктері
<li>Веб-қосымшаларды сынау құралдары мен әдістері</li></Ul>
<h5><a href="">VIII. Ойын сынағы </a></h5>
<ul>
<li>Ойын сынау мүмкіндіктері
<li>Ойындарды тексеру құралдары мен әдістері</li></Ul>
<h5><a href="">IX. Нақты жобалар мысалында бағдарламалық қамтамасыз етуді тестілеу</a> </h5>
<ul>
<li>Дамудың әртүрлі кезеңдерінде бағдарламалық қамтамасыз етуді тестілеу мысалдары
<li>Тестілеу кезінде анықталған бағдарламалық қамтамасыз етудегі қателер мен проблемаларды талдау
<li>Бағдарламалық құралды тестілеуге арналған практикалық кеңестер
				
			
			</article>
			
			
	
  		
  		</div><!-- END .front -->
  		
  		
	</div><!-- END #main_content -->

</div><!-- END #page_container -->
</body>
</html>