
<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Document</title>
  <link rel="stylesheet" href="ertegiler.css">
</head>
<body>
<div id="page_container">
  
	<div id="main_content">

		<div class="front face">
    		
    		<!-- ALL THE SITE CONTENT GOES HERE -->
    		
    		<header class="clearfix">
	
				<nav class="clearfix">
					<a id="menu-toggle" class="anchor-link" href="#mobile-nav">MENU</a>
					<ul>
          <li><a href="#">Мазмұн</a></li>
			        	<li><a href="kirispe.php">Кіріспе</a></li>	
			        	<li><a href="adister.php">Тексеру әдістері</a></li>
			        	<li><a href="quraldar.php">Тексеру құралдары</a></li>
			        	<li><a href="natige.php">Нәтижелерін талдау</a></li>
			        	<li><a href="strt.php">Тексеру стратегиялары</a></li>
                <li><a href="#">Мобильді және веб тестілеу</a></li>
                <li><a href="#">Ойын сынағы</a></li>
                <li><a href="#">Нақты жобалар</a></li>
			        	<li><a href="index.php">GALAM</a></li>
			        </ul>
				</nav>
			
				<h1>Мазұндама</h1>

			</header>
			
			
			<article class="clearfix">
  
<h5><a href=""> IV. Бағдарламалық қамтамасыз етуді тестілеуді жоспарлау және ұйымдастыру </a> </h5>
<ul>
<li>Бағдарламалық қамтамасыз етуді тексеруді жоспарлау
<li>Сынақ жоспарлары мен сценарийлерін құру
<li>Жоба аясында тестілеуді ұйымдастыру</li></Ul>
<p>
Бағдарламалық қамтамасыз етуді тестілеудің әртүрлі әдістерімен танысқаннан кейін Марк табысты нәтижелерге жету үшін тестілеу процесін дұрыс жоспарлау және ұйымдастыру қажет екенін түсінді.

Тестілеуді жоспарлаудың бірінші қадамы тесттің мақсаты мен міндеттерін анықтау болып табылады. Нақты нені сынау керек екенін, бағдарламаның қандай аспектілерін тексеріп, қандай нәтиже алу керектігін анықтау керек. Тестілеу бағдарламаның барлық негізгі функционалдығын қамтитынына және оның әртүрлі жағдайларда өнімділігін бағалайтынына көз жеткізу маңызды.

Келесі қадам сынақ жоспарлары мен сценарийлерін жасау болып табылады. Сынақ жоспары – тестілеудің мақсаттары мен міндеттерінің сипаттамасын, тестілеу ортасының сипаттамасын, сынақтан өтетін бағдарламаның негізгі мүмкіндіктерінің тізімін, сондай-ақ тестілеудің жолдары мен әдістерін қамтитын құжат.

Сынақ сценарийлері – бұл бағдарламаның белгілі бір функционалдығын тексеру үшін тестілеушінің әрекеттер тізбегін анықтайтын нұсқаулар жиынтығы. Тестілеушілер белгілі бір функционалдылықты тексеру үшін қандай қадамдар жасау керектігін оңай түсінуі үшін сынақ жағдайларының егжей-тегжейлі және анық сипатталғаны маңызды.

Жоба аясында тестілеуді ұйымдастыру да өте маңызды. Тестілеуге кім қатысатынын, әр топ мүшесінің қандай рөлдері мен міндеттері болатынын, тестілеуге қатысушылар арасындағы байланыс құрылымы мен форматы қандай болатынын анықтау қажет.

Марк тестілеуді сәтті өткізу үшін тестілеуге қажетті бюджет пен ресурстарды анықтау керектігін түсінді. Бұл қолмен тестілеу ресурстары және автоматтандырылған тестілеу ресурстары болуы мүмкін.

Сондай-ақ тестілеу белгілі бір мерзімде және тиісті сапа деңгейінде жүргізілетініне көз жеткізу маңызды. Егер қателер табылса, олардың бағдарлама жұмысына әсерін бағалау және оларды түзету қажеттілігін анықтау қажет.
</p>
				
			
			</article>
			
			
	
  		
  		</div><!-- END .front -->
  		
  		
	</div><!-- END #main_content -->

</div><!-- END #page_container -->
</body>
</html>