
<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title>Document</title>
  <link rel="stylesheet" href="ertegiler.css">
</head>
<body>
<div id="page_container">
  
	<div id="main_content">

		<div class="front face">
    		
    		<!-- ALL THE SITE CONTENT GOES HERE -->
    		
    		<header class="clearfix">
	
				<nav class="clearfix">
					<a id="menu-toggle" class="anchor-link" href="#mobile-nav">MENU</a>
					<ul>
          <li><a href="#">Мазмұн</a></li>
			        	<li><a href="kirispe.php">Кіріспе</a></li>	
			        	<li><a href="adister.php">Тексеру әдістері</a></li>
			        	<li><a href="quraldar.php">Тексеру құралдары</a></li>
			        	<li><a href="natige.php">Нәтижелерін талдау</a></li>
			        	<li><a href="strt.php">Тексеру стратегиялары</a></li>
                <li><a href="#">Мобильді және веб тестілеу</a></li>
                <li><a href="#">Ойын сынағы</a></li>
                <li><a href="#">Нақты жобалар</a></li>
			        	<li><a href="index.php">GALAM</a></li>
			        </ul>
				</nav>
			
				<h1>Мазұндама</h1>

			</header>
			
			
			<article class="clearfix">
     
<h5><a href=""> IV. Бағдарламалық қамтамасыз етуді тестілеуді жоспарлау және ұйымдастыру </a> </h5>
<ul>
<li>Бағдарламалық қамтамасыз етуді тексеруді жоспарлау
<li>Сынақ жоспарлары мен сценарийлерін құру
<li>Жоба аясында тестілеуді ұйымдастыру</li></Ul>
<p>Марк бағдарламалық жасақтаманы әзірлеуде белсенді болып қалды және сапалы өнімдерді жасау үшін бағдарламалық жасақтаманы тестілеу туралы білімін пайдаланды. Ол бағдарламалық қамтамасыз етуді тестілеу қателерді анықтау процесі ғана емес, сонымен қатар бағдарламалық қамтамасыз етудің сапасын бағалау құралы екенін түсінді.

Тестілеудің әрбір кезеңінен кейін Марк оның бағдарламасының қаншалықты жақсы жұмыс істейтінін түсіну үшін нәтижелерді талдады. Ол өз өнімінің сапасын анықтау үшін табылған қателер саны, оларды түзетуге кететін уақыт, сынақтармен кодты қамту және т.б. сияқты әртүрлі көрсеткіштерді қолданды.

Сонымен қатар, Марк тестілеу нәтижелері бойынша есептер жасады, олар бағдарлама бойынша одан әрі жұмыс туралы шешім қабылдау құралы ретінде пайдаланылды. Есептерде табылған қателер, тестілеуге кеткен уақыт және қандай сынақтар орындалғаны туралы деректер бар.

Марк сонымен қатар тестілеу нәтижелерін талқылау және келесі қадамдарды қабылдау туралы шешім қабылдау үшін әзірлеу тобының басқа мүшелерімен сөйлесті. Ол бағдарламалық қамтамасыз етуді тестілеу тек әзірлеушілерді ғана емес, басқа топ мүшелерін де қамтуы керек процесс екенін түсінді.

Бағдарламалық жасақтаманы тестілеуді білу және нәтижелерді талдау қабілетінің арқасында Марк өз өнімдерінің сапасына сенімді болды және олардың қатесіз жұмыс істейтінін сенімді түрде айта алды. Ол сондай-ақ өз командасының басқа мүшелеріне бағдарламалық қамтамасыз етуді сынауды және нәтижелерді талдауды үйретті, бұл олардың өнімдерінің сапасының жақсаруына әкелді.</p>
			
			</article>
			
			
	
  		
  		</div><!-- END .front -->
  		
  		
	</div><!-- END #main_content -->

</div><!-- END #page_container -->
</body>
</html>